{
	"Database_settings" : {
		"name": "chatbot",
		"coll_participants": "QQParticipants",
		"coll_answers": "QQAnswers",
		"coll_questions": "QQuestionnaires",
		"coll_tokens_pre": "QQLimesurveyPreTokens",
		"coll_tokens_post": "QQLimesurveyPostTokens",
		"coll_reminder_messages": "QQReminders",
		"coll_personality_orders": "PersonalityOrders",
		"host": "localhost",
		"pw": "REMOVED",
		"user": "REMOVED"
	},
	"Study_settings": {
		"ES_duration_days": 3,
		"nr_ES_day": 10,
		"days_until_post_questionnaire": -1,
		"date_for_post_questionnaire": "2020-08-19",
		"repeat_notification_day": 3,
		"time_h_between_notifcations": 2,
		"expiry_notification_time": 0,
		"days_until_considered_unresponsive": 1,
		"link_consent_text": "www.medien.ifi.lmu.de",
		"link-pre-study": "https://survey.medien.ifi.lmu.de/index.php/survey/index/sid/777848/token/$token/lang/en/newtest/Y",
		"link-post-study": "https://survey.medien.ifi.lmu.de/index.php/survey/index/sid/122423/token/$token/lang/en/newtest/Y",
		"survey-code-1": "REMOVED",
		"survey-code-2": "REMOVED",
		"survey-code-3": "REMOVED",
		"survey-code-4": "REMOVED",
		"post-survey-code": "REMOVED",
		"consent_file": "consentAndStudyInformation.pdf",
		"telegram-support-group": -999999999,
		"initial_question_id": "init01",
		"post_question_id": "off0101",
		"omit_weekends": "True",
		"es_prefix": "es",
		"link_survey_default": "https://www.soscisurvey.de/stress-bot-diane/",
		"link_survey_ext": "https://www.soscisurvey.de/stress-bot-emily/",
		"link_survey_int": "https://www.soscisurvey.de/stress-bot-isabel/",
		"link_post_study": "https://www.soscisurvey.de/stress-bot-post/",
		"link_prolific_complete": "https://app.prolific.co/submissions/complete?cc=123374A1"

	},

	"User_conversation-default": {
		"already_started": "You have already started with this study.",
		"welcome": "Hi, my name is Diane. Thank you for participating in this study. I'm here to measure your stress and help you cope with it. Therefore, I will text you everyday and ask you to answer some short questions. After three days, I will show you how stressed you've been over the last days and give you some advice on your coping behaviour. First of all, please type in your name.",
		"welcome-not-first": "Hi {name}, my name is Diane. The next days you will talk to me. For you nothing will change, I will also text you everyday and ask you to answer some questions. After three days, I will show you how stressed you've been over the week and give you some advice on your coping behaviour. Click the button below to start with today's questions.",
		"time_done": "Okay great, I will text you everyday between {start} and {end} then.",
		"es_done": "Thanks for your answers, {name}. That's all for today, talk to you tomorrow.",
		"fs_done": "Thanks for your answers, {name}. That's all for today, talk to you tomorrow.",
		"questionnaire": "Thanks for your answers. Please fill in the short questionnaire now. You can just click on the link below:",
		"questionnaire-last": "Now, please fill in the very last short questionnaire. You can just click on the link below:",
		"fs_start": "Hi {name}, I have prepared your stress report of the last three days.\nPlease click the button below to see your report. Then, have a look at it and think about your last days.",
		"ES_daily_message": "Hello {name}, let's detect your stress level today. Click the button below to start with today's questions.",
		"offboarding_message": "Hey there! I hope you had a great time. Thank you for sticking with me. I'd now like to ask you to fill out the final questionnaire. Afterwards, you'll get your compensation. Use the button below to start the post-questionnaire",
		"incorrect-code":  "This code isn't correct. Please try again.",
		"correct-code":  "Thanks, that was the right code.",
		"off-boarding-done": "You have now finished the study. Thank you very much for your participation! Here comes the Prolific Completion URL. Please click on it to prove that you have successfully completed the study.",
		"invalid-input": "Sorry, I didn't understand you...",
		"invalid-btn-input": "Sorry, I didn't understand you... Please answer the question above by using the buttons.",
		"no_stressors": "From your answers, I see that you haven't had any stressors the last days. Let me explain to you how I came to this conclusion: Each day, I asked you seven yes/no-questions. Each of those questions stands for one stressor. As you answered all of those questions with \"no\", I guess you weren't stressed at all. Very good!",
		"calc_mood": "From your free-text answers, I tried to analyse your mood for each day. Therefore, I tried to understand if the words you used to answer my questions were rather positive or negative. Here is what I thought about your mood:",
		"no_free_text": "As you didn't have any stressors on day {day}, I didn't ask you some open-ended questions. That's why I didn't analyse your mood that day.",
		"positive_mood": "On day {day}, your mood felt rather positive to me.",
		"negative_mood": "On day {day}, your mood felt rather negative to me.",
		"neutral_mood": "On day {day}, your mood felt rather neutral to me.",
		"unresponsive_message": "You have not answered any questionnaires for a while. Please respond today if you still want to participate in the study and get your reward. It is very important that you answer the questions every day. The next time you're inactive for too long again, we will have to remove you from the study",
		"answer_too_short": "Your answer was very short… Could you tell me a little bit more, so I can better understand how you feel?",
		"conv_not_complete_message": "You have not finished all of the questions yesterday. Please continue with the last question you got from me yesterday.",
		"done_message": "That was all for today, I am going to text you tomorrow. Bye bye.",
		"desc_chart1": "This first chart shows you how many stressors you've experienced the last three days. Each day, I asked you seven yes/no-questions. Every question that you answered with \"yes\" indicated one stressor. Therefore, I summed up the times you answered a yes/no-question with \"yes\" and got this as a result:",
		"desc_chart2": "This second chart shows the course of the severity of your experienced stressors the last three days. If you answered one yes/no-question with \"yes\", I asked you how stressful you felt considering several aspects like the disruption of your daily routine or your financial situation. According to your answers, I calculated how severe your stressors felt to you that day."
	},

	"User_conversation-ext": {
		"already_started": "Hmm you actually already have started with this study.",
		"welcome": "Hey there 👋 First of all, thank you so much for participating in this study! Let me introduce myself first. My name is Emily and I love hanging out with my other chatbot friends and meeting new people. So I'm really happy to meet you! Anyways, I'm here because I'm able to measure your stress and help you cope with it. Therefore, I will text you everyday and ask you to answer a couple of short questions. After three days, I want to show you how stressed you've been over the last days and give you some advice on your coping behaviour. I hope that you'll have fun chatting with me 😋 Now, please type in your name so I can call you by it.",
		"welcome-not-first": "Hey {name} 👋 The next few days you'll talk to me. But don't worry, nothing will change for you. Let me introduce myself first. My name is Emily and I love hanging out with my other chatbot friends and meeting new people. So I'm really happy to meet you! Anyways, I will also text you everyday and ask you to answer a couple of questions. After three days, I want to show you how stressed you've been over the last days and give you some advice on your coping behaviour. I hope that you'll have fun chatting with me 😋 Now, click the button below to start with today's questions.",
		"time_done": "Okay perfect 😎 I will text you everyday between {start} and {end} then.",
		"es_done": "Yeay, thanks for your answers, {name} 😎 ❤️ That's all for today 😋 I'll talk to you tomorrow. Take care!",
		"fs_start": "Hey {name} 👋 I want to show you your stress report of the last three days! Please click the button below to see your report. It will be best for you to look at it and think about your last few days. Let's see how your stress level has been 😉",
		"questionnaire": "Thaaaanks for your answers. Please fill in the short questionnaire now. Just click on the link below and you'll find it:",
		"questionnaire-last": "Now, please fill in the very last short questionnaire. Just click on the link below and you'll find it:",
		"fs_done": "Perfecttt 💪 thanks so much for your answers, {name}! That's all for today, I'll talk to you tomorrow. Already looking forward to it! 😍",
		"ES_daily_message": "Hi {name}! 😍✌️ It's time to detect your stress level today. Click the button below to start with today's questions.",
		"offboarding_message": "Hey there! I hope you had a great time. Thank you for sticking with me. I'd now like to ask you to fill out the final questionnaire. Afterwards, you'll get your compensation. Use the button below to start the post-questionnaire",
		"unresponsive_message": "You have not answered any questionnaires for a while. Please respond today if you still want to participate in the study and get your reward. It is very important that you answer the questions every day. The next time you're inactive for too long again, we will have to remove you from the study",
		"answer-not-found": "Please select one of the given answers. Unfortunately, I'm not smart enough to understand other answers.",
		"incorrect-code":  "Hmm, the code you entered isn't correct. Please try again 😋",
		"correct-code":  "Amazing, that was the correct code 😋",
		"off-boarding-done": "You have now finished the study. Thank you very much for your participation! Here comes the Prolific Completion URL. Please click on it to prove that you have successfully completed the study.",
		"invalid-input": "I'm so sorry but I didn't understand you...",
		"invalid-btn-input": "I'm so sorry but I didn't understand you... Please be so kind and answer the question above by using the buttons.",
		"no_stressors": "From your answers, I see that that you haven't had any stressors the last days. Let me explain to you how I came to this conclusion: Each day, I asked you seven yes/no-questions. Each of those questions stands for one stressor. As you answered all of those questions with \"no\", I assume that you haven't had any stressors. That's very good! I bet you didn't feel stressed at all 😎",
		"calc_mood": "From your free-text answers, I tried to understand what kind of mood you were in each day. So, basically, I looked if the words you used to answer my questions were rather positive or negative. And here is what I thought about your mood:",
		"no_free_text": "Nooow, as you didn't have any stressors on day {day} (lucky you!), I didn't ask you some open-ended questions aaand that's why I didn't analyse your mood that day.",
		"positive_mood": "Well, let's see.. On day {day}, your mood felt kinda positive to me.",
		"negative_mood": "On day {day}, your mood felt more negative to me.",
		"neutral_mood": "On day {day}, your mood felt more neutral to me.",
		"answer_too_short": "I see that your answer was very short… Could you tell me a little bit more, so I can better understand how you feel?",
		"conv_not_complete_message": "Hey, you have not finished the questions yesterday! Please continue with the last question I've sent you yesterday. 👆",
		"done_message": "That was all for today, I am going to text you tomorrow. Bye bye 👋",
		"desc_chart1": "In this first chart you can see how many stressors you've experienced the last three days. Each day, I asked you seven yes/no-questions. Every question that you answered with \"yes\" indicated one stressor. So, I summed up the times you answered a yes/no-question with \"yes\" and got this as a result:",
		"desc_chart2": "This second chart shows the course of the severity of your experienced stressors the last three days. If you answered one yes/no-question with \"yes\", I asked you how stressful you felt considering several aspects like the disruption of your daily routine or your financial situation. According to your answers, I calculated how severe your stressors felt to you that day."

	},

	"User_conversation-int": {
		"already_started": "You have already started with this study.",
		"unresponsive_message": "You have not answered any questionnaires for a while. Please respond today if you still want to participate in the study and get your reward. It is very important that you answer the questions every day. The next time you're inactive for too long again, we will have to remove you from the study",
		"welcome": "Hello there, thanks for your participation in this study. I am Isabel and I am working in the branch of psychology. Therefore, I really like reading books about psychology. I'm going to measure your stress levels and try to help you with your coping strategies. To achieve this, I will text you everyday and ask you to answer a few questions. After three days, I will present you your stress report and provide you with some advice on your coping behaviour. First of all, please type in your name.",
		"welcome-not-first": "Hello {name}, the next days you will talk to me. I am Isabel and I am working in the branch of psychology. Therefore, I really like reading books about psychology. I'm going to measure your stress levels and try to help you with your coping strategies.  For you nothing will change, I will also text you everyday and ask you to answer a few questions. After three days, I will present you your stress report and provide you with some advice. Click the button below to start with today's questions.",
		"time_done": "Okay good, I will text you everyday between {start} and {end} then.",
		"es_done": "That is it for today. Thank you and see you tomorrow.",
		"fs_start": "Hello {name}, I have prepared your stress report of the last three days. Please click the button below to see your report.",
		"questionnaire": "Please fill in the short questionnaire now. Please just click on the link below:",
		"questionnaire-last": "Now, please fill in the very last short questionnaire. Please just click on the link below:",
		"fs_done": "Thanks for your answers, {name}. That is all for today, talk to you tomorrow.",
		"ES_daily_message": "Hello {name}, it is time to detect your stress level today. Click the button below to start with today's questions.",
		"offboarding_message": "Hey there! I hope you had a great time. Thank you for sticking with me. I'd now like to ask you to fill out the final questionnaire. Afterwards, you'll get your compensation. Use the button below to start the post-questionnaire",
		"answer-not-found": "Please select one of the given answers. Unfortunately, I'm not smart enough to understand other answers.",
		"incorrect-code":  "Unfortunately, this code is incorrect. Please try again.",
		"correct-code":  "Thank you, this code was correct.",
		"off-boarding-done": "You have now finished the study. Thank you very much for your participation! Here comes the Prolific Completion URL. Please click on it to prove that you have successfully completed the study.",
		"invalid-input": "Sorry, I didn't understand you...",
		"invalid-btn-input": "Sorry, I didn't understand you... Please answer the question above by using the buttons.",
		"no_stressors": "While analysing your answers, I've noticed that you haven't had any stressors the last days. Let me explain to you how I came to this conclusion: Each day, I asked you seven yes/no-questions. Each of those questions stands for one stressor. As you answered all of those questions with \"no\", I assume that you were not stressed the last three days.",
		"calc_mood": "From your free-text answers, I tried to analyse your mood for each day. Therefore, I tried to examine your word usage while answering my questions and investigated if they were rather positive or negative. Here are my thoughts about your mood:",
		"no_free_text": "As you did not experience any stressors on day {day}, I did not ask you some open-ended questions. That's why I didn't analyse your mood that day.",
		"positive_mood": "On day {day}, your mood felt rather positive to me.",
		"negative_mood": "On day {day}, your mood felt rather negative to me.",
		"neutral_mood": "On day {day}, your mood felt rather neutral to me.",
		"conv_not_complete_message": "You have not finished my entire questionnaire yesterday. Please continue by answering the last question you received from me yesterday.",
		"answer_too_short": "I've noticed that that was a very short answer… If you don't mind would you be so kind to provide a bit more details for me to better apprehend your feelings?",
		"done_message": "That was all for today, I am going to text you tomorrow. Bye bye.",
		"desc_chart1": "This first chart depicts you how many stressors you have experienced the last three days. Each day, I asked you seven yes/no-questions. Every question that you replied with \"yes\" indicated one stressor. Therefore, I added up the times you replied a yes/no-question with \"yes\". You may find the results of my calculation here:",
		"desc_chart2": "In this second chart, I tried to calculate the severity of your experienced stressors the last three days. If you answered one yes/no-question with \"yes\", I asked you how stressful you felt taking various aspects like the disruption of your daily routine or your financial situation into account. According to your answers, I calculated how severe your experienced stressors felt to you that day."

	}

}